{
  "id": "pi-hole",
  "title": "Pi-hole",
  "name": "Pi-hole",
  "icon": "https://getumbrel.github.io/umbrel-apps-gallery/pi-hole/icon.svg",
  "tagline": "Block ads on your entire network",
  "overview": "Instead of browser plugins or other software on each computer, install Pi-hole® on your Umbrel and your entire network is protected. Network-level blocking allows you to block ads in non-traditional places such as mobile apps and smart TVs, regardless of hardware or OS. Since advertisements are blocked before they are downloaded, network performance is improved and will feel faster. \n\nIn addition to blocking advertisements, Pi-hole® has an informative Web interface that shows stats on all the domains being queried on your network. Pi-hole® works fine with an existing DHCP server, but you can use Pi-hole®'s to keep your network management in one place.\n\nPi-hole® and the Pi-hole® logo are registered trademarks of Pi-hole. Umbrel is not sponsored, endorsed by, or associated with Pi-hole®.",
  "category": [
    "networking"
  ],
  "developer": "Pi-hole®",
  "screenshots": [
    "https://getumbrel.github.io/umbrel-apps-gallery/pi-hole/1.jpg",
    "https://getumbrel.github.io/umbrel-apps-gallery/pi-hole/2.jpg",
    "https://getumbrel.github.io/umbrel-apps-gallery/pi-hole/3.jpg"
  ],
  "version": "2025.11.1",
  "releaseNotes": "⚠️ If you have set up your router to use Pi-hole as its only DNS server, umbrelOS may be unable to resolve domain names during the update, preventing it from downloading the update files. To avoid issues, temporarily set a backup DNS server (e.g., 1.1.1.1) on your router before updating— or configure a permanent fallback DNS to prevent future issues.\n\nThis release includes several improvements and bug fixes:\n  - Improved FTL startup detection and log tailing\n  - Added RISCV architecture support back\n  - Updated DNS listening mode to 'ALL' in the example docker-compose.yml\n  - Added instructions for excluding Pi-hole from Watchtower updates\n\n\nFull release notes can be found at https://github.com/pi-hole/docker-pi-hole/releases/tag/2025.11.1",
  "port": 8082,
  "path": "/admin/",
  "website": "https://pi-hole.net",
  "repo": "https://github.com/pi-hole/docker-pi-hole"
}
